In [14]:
import pandas as pd
import numpy as np

In [3]:
sozlukVerisi = {"Istanbul":[30,29,np.nan],"Ankara":[20,np.nan,25],"Izmir": [40,39,38]}
havaDurumuDataFrame = pd.DataFrame (sozlukVerisi )

In [4]:
havaDurumuDataFrame

   Istanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [6]:
havaDurumuDataFrame.dropna()

   Istanbul  Ankara  Izmir
0      30.0    20.0     40

In [7]:
havaDurumuDataFrame.dropna(axis=1)

   Izmir
0     40
1     39
2     38

In [18]:
yeniVeri = {"Istanbul":[30,29,np.nan],"Ankara":[20,np.nan,25],"Izmir": [40,39,38],"Antalya":[45,np.nan,np.nan]}
yeniDataFrame = pd.DataFrame (yeniVeri )

In [19]:
yeniDataFrame

   Istanbul  Ankara  Izmir  Antalya
0      30.0    20.0     40     45.0
1      29.0     NaN     39      NaN
2       NaN    25.0     38      NaN

In [21]:
yeniDataFrame.dropna(axis= 1,thresh=2) #thresh limit koymaktır iki ve üstü değer olanlara istediğinizi yapar

   Istanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [23]:
yeniDataFrame.fillna(20) #boş değerlerin yerine parantez içindeki sayıyı yazar

   Istanbul  Ankara  Izmir  Antalya
0      30.0    20.0     40     45.0
1      29.0    20.0     39     20.0
2      20.0    25.0     38     20.0

## GroupBy

In [28]:
 maasSozlugu = {"Departman": ["Yazılım","Yazılım","Pazarlama","Pazarlama","Hukuk","Hukuk"],
                            "Calisan Ismi"   : ["Ahmet","Mehmet","Fatma","Ayse","Zeynep","Ali"],
                            "Maas"  : [4000,3000,6000,3000,5000,4000]
                            }

In [29]:
maasDataFrame = pd.DataFrame(maasSozlugu)

In [30]:
maasDataFrame

   Departman Calisan Ismi  Maas
0    Yazılım        Ahmet  4000
1    Yazılım       Mehmet  3000
2  Pazarlama        Fatma  6000
3  Pazarlama         Ayse  3000
4      Hukuk       Zeynep  5000
5      Hukuk          Ali  4000

In [34]:
groupObject = maasDataFrame.groupby("Departman")
groupObject.count()

           Calisan Ismi  Maas
Departman
Hukuk                 2     2
Pazarlama             2     2
Yazılım               2     2

In [35]:
groupObject.mean()

           Maas
Departman
Hukuk      4500
Pazarlama  4500
Yazılım    3500

In [36]:
groupObject.max()

          Calisan Ismi  Maas
Departman
Hukuk           Zeynep  5000
Pazarlama        Fatma  6000
Yazılım         Mehmet  4000

In [37]:
groupObject.min()

          Calisan Ismi  Maas
Departman
Hukuk              Ali  4000
Pazarlama         Ayse  3000
Yazılım          Ahmet  3000

In [38]:
groupObject.describe()

           Maas
          count    mean          std     min     25%     50%     75%     max
Departman
Hukuk       2.0  4500.0   707.106781  4000.0  4250.0  4500.0  4750.0  5000.0
Pazarlama   2.0  4500.0  2121.320344  3000.0  3750.0  4500.0  5250.0  6000.0
Yazılım     2.0  3500.0   707.106781  3000.0  3250.0  3500.0  3750.0  4000.0